$(function(){

    /*
    * Работа с ЧПУ
     */
    function make_translit (text) {
        var words = {"а": "a", "б": "b", "в": "v", "г": "g", "ѓ": "g`", "ґ": "g`", "д": "d", "ђ": "d", "е": "e", "ё": "yo", "є": "ye", "ж": "zh", "з": "z", "ѕ": "z`", "и": "i", "й": "j", "ј": "j", "і": "i`", "ї": "yi", "к": "k", "ќ": "k`", "л": "l", "љ": "l`", "м": "m", "н": "n", "њ": "n`", "о": "o", "п": "p", "р": "r", "с": "s", "т": "t", "ћ": "c", "у": "u", "ў": "u`", "ф": "f", "х": "kh", "ц": "cz", "ч": "ch", "џ": "dh", "ш": "sh", "щ": "shh", "ъ": "`", "ы": "y`", "ь": "`", "э": "e`", "ю": "yu", "я": "ya", "’": "'", "ѣ": "ye", "ѳ": "fh", "ѵ": "yh", "ѫ": "o`", "№": "#", "А": "A", "Б": "B", "В": "V", "Г": "G", "Ѓ": "G`", "Ґ": "G`", "Д": "D", "Ђ": "D", "Е": "E", "Ё": "Yo", "Є": "Ye", "Ж": "Zh", "З": "Z", "Ѕ": "Z`", "И": "I", "Й": "J", "Ј": "J", "І": "I`", "Ї": "Yi", "К": "K", "Ќ": "K`", "Л": "L", "Љ": "L`", "М": "M", "Н": "N", "Њ": "N`", "О": "O", "П": "P", "Р": "R", "С": "S", "Т": "T", "Ћ": "C", "У": "U", "Ў": "U`", "Ф": "F", "Х": "Kh", "Ц": "Cz", "Ч": "Ch", "Џ": "Dh", "Ш": "Sh", "Щ": "Shh", "Ъ": "`", "Ы": "Y`", "Ь": "`", "Э": "E`", "Ю": "Yu", "Я": "Ya", "Ѣ": "Ye", "Ѳ": "Fh", "Ѵ": "Yh", "Ѫ": "O`", " ": "-"};
        var result='';
        for (i=0; i < text.length; i++) {
            if (words[text[i]]) {
                result += words[text[i]];
            } else {
                result += text[i];
            }
        }
        var str = result.replace(/[^-0-9A-Za-z]/gim,'');
        return str.toLowerCase();
    } 
    $('.trigger-input-translit').on('change', function() {
        $('.input-translit').val(make_translit($(this).val()));
    });
    /**
     * Работа с ЧПУ end
     */
});